[
    {
        "url": "https://gobblerconnect.vt.edu/event/11819969",
        "Description": "Stop by the Student Engagement Chillfield to play some games, pick up some free swag, and learn about the upcoming\nInternational Education.\nWeek events\nThe Chillfield will have games, a button-making station, IEW tattoos, and candy. Additionally, you can view this year's Hokie Culture Crawl t-shirt.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11819969"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11812020",
        "Description": "Speaker Bio\nDr. Elizabeth Pettit is a Senior Human Factors Scientist at Exponent, based in Los Angeles, CA. She has expertise in the cognitive processes and environmental factors that influence decision-making and has been retained to provide human factors analyses for various legal matters. She also assists with ongoing user study research.\nDr. Pettit uses her knowledge and expertise to evaluate how perception, memory, reaction time, and human information processing influence a variety of situations, including automotive, aviation, industrial, and occupational accidents; risk communication; warning compliance; and the human factors contributing to slip/trip-and-fall incidents.\nShe received her Ph.D. in Cognitive Psychology from Miami University (Ohio) in 2021. Dr. Pettit is also an Adjunct Professor at Montclair State University, where she teaches courses such as\nThe Psychology of Judgment and Decision Making and Psychology Research Methods\n.\nEvent Description\nThis seminar bridges theory and practice by illustrating how human factors methods are applied to real-world challenges such as accident investigation, product usability, and safety-critical systems. The talk will provide students with professional development and mentoring insights, expose them to multidisciplinary problem-solving, and inspire research or project ideas grounded in industry challenges. To maximize impact, the event will include interactive case studies, Q&A, and follow-up activities that extend the value beyond a single lecture.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11812020"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11547968",
        "Description": "Miss reading time? Looking for community? Join us for time and space to relax, build community, and focus on personal reading.  You can bring your own material or grab a library book!  This is an opportunity to engage in personal reading and meet like-minded students through optional activities.  You can stay for as long or as little as you would like.  There will also be free snacks, swag, and prize opportunities!\nIf you are an individual with a disability and desire an accommodation, please contact Colleen Driscoll at colleenmd@vt.edu during regular business hours at least 10 business days prior to the event.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11547968"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11858607",
        "Description": "Join us at the Women's Center for our paint & sip event!\nA laid-back painting space with simple prompts for inspiration\nA colorful mocktail bar and light snacks\nMusic, conversation, and community in a welcoming atmosphere\nThis event is free and open to all\nSupplies included!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11858607"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11511231",
        "Description": "",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11511231"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11626274",
        "Description": "Join us for Air Clay Creations at the Graduate Life Center on Wednesday, November 5, 2025! This hands-on workshop is a chance to relax, get creative, and craft your own unique clay pieces using lightweight, air-dry clay. No prior experience is needed—just bring your imagination.\nWhether you want to sculpt small décor, design personalized gifts, or simply enjoy a mindful break from your routine, this event is the perfect way to express yourself in a fun, low-pressure environment. All materials will be provided.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11626274"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11499281",
        "Description": "Zine Workshop: Queer Collage\nThursday, November 6 1-3pm in the Pride Center\nCome & Collage!\nThe history of queer collage is marked by its use as a subversive tool to deconstruct and reconstruct identity, creating new worlds and challenging heteronormative assumptions. Artists have used collage to express fluid gender, reclaim historical narratives, and create safe spaces, ranging from the early work of artists like Ray Johnson and political commentary from figures like Ralph Arnold to the contemporary practices of artists like Lovie Olivia and Rakeem Cunningham.\nGood vibes, supplies, & snacks provided\nFor questions or accommodations, contact Haleigh Wallace at\nhaleighwallace@vt.edu\n.\nOnline submissions also welcome! Submit your piece here:\nhttps://docs.google.com/forms/d/e/1FAIpQLSe02gqux9AiLpzPwZm_QdmPZSP7acWh9AOR8O1NDifJu8_N_Q/viewform?pli=1&authuser=0\nThis event is open to all and all are welcome to contribute to the project.\nFor accommodations contact Haleigh Wallace at haleighwallace@vt.edu.",
        "info_urls": [
            {
                "label": "https://docs.google.com/forms/d/e/1FAIpQLSe02gqux9AiLpzPwZm_QdmPZSP7acWh9AOR8O1NDifJu8_N_Q/viewform?pli=1&authuser=0",
                "url": "https://docs.google.com/forms/d/e/1FAIpQLSe02gqux9AiLpzPwZm_QdmPZSP7acWh9AOR8O1NDifJu8_N_Q/viewform?pli=1&authuser=0"
            },
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11499281"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11835510",
        "Description": "Join us for an open dialogue with Dr. André Dominic Cropper (EE Ph.D ’95), a distinguished Engineering Fellow at Raytheon as he reflects on his experience at Virginia Tech and beyond.\nDr. André Dominic Cropper (EE Ph.D ‘95) is a distinguished Engineering Fellow at Raytheon with advanced expertise in hyperspectral imaging, aerospace, and systems engineering. His innovative contributions have significantly enhanced the field of materials science and electrical engineering, earning him multiple patents including early work on technology supporting OLED-based touch screens. His work has been recognized through numerous inventor and STEM awards; including the AISES Professional of the Year award in 2014 and the Caribbean Global Hall of Excellence Lifetime Achievement award in 2025.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11835510"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11712990",
        "Description": "Registration Link: http://bit.ly/3HFpz8o",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11712990"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11617808",
        "Description": "During these lunches, Latinx graduate students and friends have the opportunity to connect and engage with one another by sharing and celebrating their cultures. These gatherings not only foster social connections but also provide a chance to exchange stories, traditions, and experiences, enriching the community as a whole. Everyone is welcome!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11617808"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11370482",
        "Description": "This is How We Roll\nDate: Friday, November 7, 2025\nTime: 2:00 – 4:00 PM ET\nLocation: Squires Student Center, Room 140\nSPECIAL This is How We Roll!\nFood often serves as the basis for finding common ground. This is How We Roll is a series that focuses on bringing people together through the theme of food. Each event will feature a different dish that is typically rolled up. Faculty and invited speakers will teach participants recipes and share the historical significance of a particular dish. In November, we will feature bento boxes, a Japanese way of packing lunches Participants will be able to make their own sushi rolls and learn about the origins of this delicious meal. Vegan and vegetarian options available. Registration is required due to space limitations. Light refreshments will be provided.\nSpace is limited to 40 people. RSVP here to secure your space and choose a timeslot:\nhttps://forms.office.com/r/XcNXfYdgdE\n• Slot A: 2:00 - 3:00pm (20 people max)\n• Slot B: 3:00 - 4:00pm (20 people max)",
        "info_urls": [
            {
                "label": "https://forms.office.com/r/XcNXfYdgdE",
                "url": "https://forms.office.com/r/XcNXfYdgdE"
            },
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11370482"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11333818",
        "Description": "🎉\nExperience the Vibrant Spirit of Japan!\n🇯🇵\nJoin the\nNikkei Student Union at Virginia Tech\n,\nDining Services\n, and the\nCranwell International Center\nfor an unforgettable celebration of Japanese culture!\n📍\nDeet’s Place (Large Side Room)\n📅\nFriday, November 7th, 4:00 PM to 6:00 PM\n🎟\nFree Admission + Exciting Giveaways!\n✨\nWhat to Expect:\nEnjoy\nsavory and sweet Japanese dishes\nand an\nauthentic beverage\n, all provided by Dining Services\nExplore\ncolorful cultural displays\ncreated by VT's own Nikkei Student Union\nWatch\nstudent-led presentations\nthat bring Japan’s rich history and traditions to life\nTest your knowledge in\nfun trivia games\nWin prizes — including a chance to score\n2 FREE tickets to a Center for the Arts performance!\nThis is your chance to\nimmerse yourself in Japanese culture\n, connect with new people, and celebrate the beauty of cultural community right here at Virginia Tech!\n📧\nAccessibility Accommodations:\nIf you are an individual with a disability and require accommodations, please contact\nFawna Zwart\nat\nfawna@vt.edu\nduring regular business hours at least\n10 business days before the event\n.\nCome curious, leave inspired —\nようこそ！(Welcome!)",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11333818"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11771398",
        "Description": "The Forest Resources and Environmental Conservation's Graduate Student Association (FGSA) is hosting another inter-departmental Pizza Night open to all graduate students in the College of Natural Resources and Environment (CNRE)—including Forest Resources and Environmental Conservation, Fish and Wildlife Conservation, Geography, and Sustainable Biomaterials.\nBy sharing a meal, we aim to break down barriers to participation while fostering collaboration, interdisciplinary dialogue, and resource sharing among CNRE graduate students. These recurring gatherings will provide a consistent, inclusive space that promotes well-being, builds both professional and personal connections, and strengthens our graduate student community.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11771398"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11854629",
        "Description": "Wesley is hosting a Nintendo Night!! We will have a variety of Nintendo games able to be played around our building.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11854629"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11752606",
        "Description": "✨\nVT SIA Presents: The Diwali Formal\n✨\nGet ready to light up the night at the\nDiwali Formal\n— your chance to shine in your best\nSuits & Saris!\nJoin us for an unforgettable evening filled with music, dance, and celebration as we honor the Festival of Lights in style. 🎆\n📅\nDate:\nFriday, November 7th\n⏰\nTime:\n5:00 PM – 9:00 PM\n📍\nLocation:\nSquires Ballroom\n🎟️\nTickets:\nDrop 1: $8\nDrop 2: $12\nAt the Door: $20\n💫\nMember Perk:\nAll VT SIA members receive a\n$3 promo code!\nIf you haven’t received yours yet, reach out to us via DMs.\n⚠️\nPromo codes will not be redeemable at the door.\n🕺💃 Don’t miss your chance to perform!\n🚨\nClass Dance Form closes on October 17th!\n🚨\nCome celebrate Diwali with lights, laughter, and lasting memories — we can’t wait to see you there! 🌟",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11752606"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11775944",
        "Description": "Our annual National First-Generation College Celebration Week Kick-off event, where first-generation students at Virginia Tech TAKE UP SPACE! The entire Break Zone facility is rented out for first-generation students and friends. We will have free games, swag, and food\n!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11775944"
            },
            {
                "label": "Talk-O Tuesday – Career Skill Building (How to Align Your Academic and Career Goals, Resume Check-up, Getting LinkedIn)Tuesday, November 11 at 5:30PM ESTNewman LibraryHosted by 2 organizations",
                "url": "https://gobblerconnect.vt.edu/event/11776767"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11568376",
        "Description": "Come talk about life with us! This is Church on Main's life group for college students, where all are welcome and loved. We do our best to keep it real, look for grace, and follow God. We meet after the 11:00 service at Church on Main. Currently reading When Christians Get it Wrong by Adam Hamilton.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11568376"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11776304",
        "Description": "Similar to statewide events happening this fall, this inaugural\nevent designed to provide assistance to students and families\nat Virginia Tech and the NRV\nwith completing the Free Application for Federal Student Aid (FAFSA) for college\n, learning about the college application process (undergrad and graduate school), and promote resources available at VT\n.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11776304"
            },
            {
                "label": "Talk-O Tuesday – Career Skill Building (How to Align Your Academic and Career Goals, Resume Check-up, Getting LinkedIn)Tuesday, November 11 at 5:30PM ESTNewman LibraryHosted by 2 organizations",
                "url": "https://gobblerconnect.vt.edu/event/11776767"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11443155",
        "Description": "DATE: Mondays starting September 15, 2025\nTIME: 4:00 – 6:00 PM EST\nLOCATION: APIDA + Center (140 Squires)\nLooking for a weekly boost to stay on track with your classes? Let's Lock In meets once a week – every Monday - to give you a dedicated time and space to focus, get support, and make real progress. Join other students in a relaxed, productive environment where tutors are on hand to help with coursework, and other campus resources are just a step away. Think of it like study hall, but better: whether you're tackling tough assignments, prepping for exams, or just trying to stay organized, Let's Lock In is here to help. Drop in, get focused, and leave feeling accomplished.\nCo-sponsored with the APIDA + Center/AANAPISI Initiative and the Student Success Center",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11443155"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11770762",
        "Description": "Join the College of Science for First Generation Celebration Week for a scavenger hunt in Squires! Learn more about resources, connect with other students, and win prizes. Dinner will be provided!\nIf you are an individual with a disability and desire an accommodation, please contact Jess Hoopengardner at jessh@vt.edu at least 10 business days prior to the event.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11770762"
            },
            {
                "label": "Talk-O Tuesday – Career Skill Building (How to Align Your Academic and Career Goals, Resume Check-up, Getting LinkedIn)Tuesday, November 11 at 5:30PM ESTNewman LibraryHosted by 2 organizations",
                "url": "https://gobblerconnect.vt.edu/event/11776767"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11854665",
        "Description": "Wesley is hosting a PJ's & Popcorn Movie Night!! We will be watching Meet the Robinson's!! Come dressed in your best and most comfortable PJ's, there is a prize for the best pajamas!!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11854665"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11820072",
        "Description": "Please join us for the International Education Week Opening Reception at Perspectives Gallery in Squires Student Center.  Enjoy some complimentary hors devours and enjoy the artwork of\nEugene Maurakis\nSeascapes of the 21st Century\n.\nWe will be promoting the International Education Week events and enjoying some fellowship",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11820072"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11810388",
        "Description": "How it Works\nStep 1:\nPick up a passport\nFind the passport at the Opening Reception on Tuesday, Nov. 11, between 5 p.m. and 6:00 p.m. in the Perspectives Gallery (Squires Student Center).\nIf you can't make it to the opening reception, a downloadable passport card will be made available  after the opening reception.\nStep 2:\nAttend as many IEW events as you can!\nYou will get a unique stamp in your passport for each IEW event you attend. (Online events will send you a digital stamp.)\nIf you get\nat least six stamps\n, you've earned your Hokie Culture Cawl 2025 T-shirt designed by the VT Doodler!\nStep 3:\nPick up your shirt\nAt the end of the week, the first 400 students who present passports with at least six stamps at the Multilingual Open Mic Night  on Tues., Nov 18 from 6-7:30 (Harper Hall) will get the exclusive t-shirt!\nCan't make it to the Multilingual Open Mic Night? Students may also pick up their shirts on Wednesday, Nov. 19 at the Global Education Office during normal business hours.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11810388"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11810581",
        "Description": "Join the Global Education Office (GEO) at the International Education Week (IEW) Opening Reception, where we will unveil the 2024-2025 Photo/Video Contest winners.\nPick up some hors devours catered by Heathwood Marketplace, and enjoy the art of\nEugene Maurakis\nat Perspectives Gallery.  Winners will be announced at 5:45 pm.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11810581"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11411549",
        "Description": "Every Tuesday this fall, the first five students to meet at Turner Place Dining Hall at 5:15 PM will get their meal covered! Join the Program Director and your fellow Securitas community members for a weekly dinner hangout before your evening class. It’s a great way to relax, connect, and enjoy good food together. Turner Tuesday runs from August 26 to December 2, 5:15–6:15 PM. First come, first served!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11411549"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11497940",
        "Description": "Queer Media Club\nNovember's Theme: That's Queer, right? Queer readings, subtext, and symbols\nSign up to share your queer media pitches:\nbit.ly/qmcpoll1\nTuesday, November 11 | 5:00 - 6:30 PM\nPride Center (Squires 227)\nQueer media club is a monthly space where we gather to talk about all things media: movies, music, books, games, and more! The theme for November is TBD.\n5:00 - 5:30 will be time for pizza and socializing\n5:30 - 6:30 will be our group discussion\nAll are welcome to join!\nFor accommodations, contact\ndigilit-g@vt.edu\nas soon as possible.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11497940"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11851871",
        "Description": "Join us to make lentil stew and learn about the health and nutritional impacts of lentils!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11851871"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11776767",
        "Description": "First-generation students\nare regularly achieving their\nacademic, personal, and professional\ngoals and\nwe are grateful that they brought their talent to\nVirginia Tech\n! Talk-Opportunity Tuesdays (Talk-O Tuesdays) is a time to connect our experiences and intellect in a space where\nfirst-gen\nis the most\nimportant element\n! Each month we will enjoy a meal, meet other first-gen students, faculty, alumni, and employers.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11776767"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11833860",
        "Description": "Calling all freshman, sophomores, and juniors!\nJoin us in the BCC on the 11th of November\nfor a senior panel discussion on how\nto\nnavigating through the last year attending Virginia Tech. A panel of seniors will be giving pointers out to students on what they can expect, what they should prepare for, and what they need to do to get here in the first place. Food will be\nprovided\nand students can even get one on one time with the panelists before and after the event. All are welcome!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11833860"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11838258",
        "Description": "🌍\nDance of Nations 2025\n🌎\nGet ready for one of the most vibrant nights of the year!\nThe\nCouncil of International Student Organizations (CISO)\nand the\nCranwell International Center\nare bringing back their annual\nDance of Nations (DON)\n— happening\nNovember 11th, 6–8 PM\nat\nHaymarket Theatre, Squires Student Center\n.\n💃🕺 Experience a night full of\nmusic, dance, and culture\nfrom around the world, all brought to life by over\n15 international student performances\n! It’s your chance to vibe with different cultures, celebrate diversity, and connect with people who share (or spark!) your global spirit.\n✨\nFREE ENTRY + open to everyone\n🍪\nFree refreshments\nduring intermission\n🌐 Part of\nInternational Education Week\nCome for the culture, stay for the energy. Don’t miss out — this is\nthe\ninternational event of the semester!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11838258"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11790931",
        "Description": "Join us this\nVeterans Day\n,\nNovember 11th\n, for a special screening of\nUntold Valor\nat the\nLyric Theater\n. Doors open at\n7:00 PM\n! Free and Open to the Public! Registration is Required:\nRVSP Link:\nhttps://virginiatech.questionpro.com/a/TakeSurvey?tt=/8ve1MW%2BI3gECHrPeIW9eQ%3D%3D\nUntold Valor\nfollows the incredible story of Corporal Jack Aikins, a young soldier personally recruited by General George S. Patton to join an elite 13-man Comanche task force formed by the U.S. Army during World War II. This covert unit played a pivotal role in the intelligence war, using the Comanche language for battlefield communication. Operating in secrecy across Europe, their bravery and skill safeguarded Allied plans and shaped key victories—marking one of the most remarkable chapters of Indigenous service and heroism in American military history.\nFollowing the screening, there will be a\nQ&A session\nfeaturing\nChoctaw Film Director Ise White\n,\nWichita/Comanche Actor Derek Garza\n,\nCinematographer John Engstrom\n, and\nJoe Taylor Chibitty\n, a descendant of Comanche Code Talker\nCharles J. Chibitty\n.\nA reception with light refreshments will follow the discussion.\nThis event is hosted by the School of Visual Arts (SOVA) and Ati Wa: Oki Indigenous Community Center (ICC) and supported by the partnerships of Office of Veteran Services, the Pamplin College of Business, the College of Liberal Arts and Human Sciences, School of Communications, Native@VT, Indigenous Community Garden (ICG), Indigenous Studies Program, Department of Modern and Classical Languages and Literatures, Department of History, Department of Political Science, Academic Success Initiatives, Center for Peace Studies and Violence Prevention\nTrailer Link: https://youtu.be/24ymnrZLvLc?si=8blw066K__Q9af3N",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11790931"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11790932",
        "Description": "Join us this\nVeterans Day\n,\nNovember 11th\n, for a special screening of\nUntold Valor\nat the\nLyric Theater\n. Doors open at\n7:00 PM\n! Free and Open to the Public! Registration is Required:\nRVSP Link:\nhttps://virginiatech.questionpro.com/a/TakeSurvey?tt=/8ve1MW%2BI3gECHrPeIW9eQ%3D%3D\nUntold Valor\nfollows the incredible story of Corporal Jack Aikins, a young soldier personally recruited by General George S. Patton to join an elite 13-man Comanche task force formed by the U.S. Army during World War II. This covert unit played a pivotal role in the intelligence war, using the Comanche language for battlefield communication. Operating in secrecy across Europe, their bravery and skill safeguarded Allied plans and shaped key victories—marking one of the most remarkable chapters of Indigenous service and heroism in American military history.\nFollowing the screening, there will be a\nQ&A session\nfeaturing\nChoctaw Film Director Ise White\n,\nWichita/Comanche Actor Derek Garza\n,\nCinematographer John Engstrom\n, and\nJoe Taylor Chibitty\n, a descendant of Comanche Code Talker\nCharles J. Chibitty\n.\nA reception with light refreshments will follow the discussion.\nThis event is hosted by the School of Visual Arts (SOVA) and supported by the partnerships of Office of Veteran Services, the Pamplin College of Business, the College of Liberal Arts and Human Sciences, School of Communications, Ati Wa: Oki Indigenous Community Center (ICC), Native@VT, Indigenous Community Garden (ICG), Indigenous Studies Program, Department of Modern and Classical Languages and Literatures, Department of History, Department of Political Science, Academic Success Initiatives, Center for Peace Studies and Violence Prevention\nTrailer Link: https://youtu.be/24ymnrZLvLc?si=8blw066K__Q9af3N",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11790932"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11806827",
        "Description": "Get some donuts for them for extra calories and freshly brewed coffee for the extended working hours (courtesy of your PI). Blow off some steam and look forward to some fun chit-chat and lively banter with all the graduate students in the Department of Mechanical Engineering. It is a great platform to discuss work or classes with your ME peers, if you may (we are looking at all you nerds and geeks). Network, socialize, and put on some weight while at it!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11806827"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11823314",
        "Description": "Kick-off International Education Week with the Graduate School at our annual Giving Thanks Around the World event. Join us for food, drinks, and community with a traditional Thanksgiving meal. Student, faculty, and staff will gather together to celebrate diverse cultures, featuring a shared lunch. Participants are encouraged to bring a small dish, to discuss and share the cultural significance. The Graduate School will provide the main traditional American dishes.\nPlease RSVP no later than Tuesday, November 5th\nso we can have a headcount!\nWhen: Wednesday, November 12th 2025 | 12PM-1:30PM\nWhere: Boeing Auditorium, Academic Building One\nIf you have any questions, please reach out to the Graduate School via email at\ndcgradschool@vt.edu",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11823314"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11382268",
        "Description": "The Multi-Heritage Support Group is a monthly wellness program that is an affirming space offering students a chance to share stories, explore the complexity of navigating multiple identities, and build community with others who hold rich and layered identities.\nEach session features peer support, open discussions, and guided reflections, facilitated by Dr. Julie Chandler from the Cook Counseling Center and a Peer Wellness Mentor from the AANAPISI Initiative. Topics may include belonging, family dynamics, code-switching, colorism, and navigating societal expectations, and other topics related to multi-heritage identities.\nThis program is open to all and light refreshments will be provided.\n--\nIf you are an individual with a disability and desire an accommodation, please contact Gia Ha at giaha@vt.edu or 540-231-3399 during regular business hours at least 10 business days prior to the event.\nCo-sponsored by AANAPISI Initiative at Virginia Tech, APIDA + Center, Ati: Wa:oki Indigenous Community Center, Cook Counseling Center. Funded by the US Department of Education AANAPISI grant.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11382268"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11823862",
        "Description": "Join SL Ricardo and the LSCRC in a night of betting on Marbles to complete a marble race and learn about safe betting strategies! Earn House Cup Points and get pizza by betting on the best marble!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11823862"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11776950",
        "Description": "Join\nus for\nour\n6\nth annual faculty and student mixer\n.\nThis\nis\na mutual opportunity to network, share experiences, and build connections. This event is an important platform to inspire and empower each other as we navigate our educational and professional journeys.\nStudents will have an opportunity to\nmatch with\na mentor during the event.\nFood will be served. Business\ncasual/\nprofessional is encouraged.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11776950"
            },
            {
                "label": "Talk-O Tuesday – Career Skill Building (How to Align Your Academic and Career Goals, Resume Check-up, Getting LinkedIn)Tuesday, November 11 at 5:30PM ESTNewman LibraryHosted by 2 organizations",
                "url": "https://gobblerconnect.vt.edu/event/11776767"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11646817",
        "Description": "Warm up those vocal cords for a fun night of karaoke on November 12 from 7pm-9pm! You can pick your own songs to sing your heart out! We'll also be playing karaoke-based games like Blind Karaoke, Guess the Song, and Don't Forget the Lyrics. Bring your friends to Commonwealth Ballroom in Squires for a night of singing-filled fun!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11646817"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11655487",
        "Description": "This event aims to raise awareness of and increase understanding for the experiences of queer and trans international students. Free lunch will be provided by Roots Natural Kitchen. All are welcome to join.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11655487"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11786091",
        "Description": "Join the Roanoke Graduate Student Association for our monthly meeting to discuss initiatives to improve graduate life and wellbeing on the Roanoke FBRI campus. Connect with fellow graduate and professional students over a light lunch of Panera pastries, and learn about RGSA's upcoming events. Come with any questions or comments you may have about life as a graduate student in Roanoke!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11786091"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11649712",
        "Description": "The goal is to offer a roadmap for academic career progression—highlighting how individuals have navigated their paths, the key steps they took, and the strategies that helped them advance. The seminar will provide insight into the practical aspects of building a successful academic career, such as mentorship, networking, balancing responsibilities, and long-term planning.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11649712"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11817095",
        "Description": "Come with SL Kathleen to the Duck Pond clean-up hosted by the District 3 team. We'll meet under the arch together and walk over to New Residence Hall East to meet up with the rest of the group and get hot drinks and supplies. Then, we'll start our cleanup and walk to the Duck pond, and return by 6:30. Plus, you get a free rubber duck!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11817095"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11713074",
        "Description": "Please register for Zoom Link: https://virginiatech.zoom.us/meeting/register/WFd4zBJcRFeTPl7-9_wJAw",
        "info_urls": [
            {
                "label": "https://virginiatech.zoom.us/meeting/register/WFd4zBJcRFeTPl7-9_wJAw",
                "url": "https://virginiatech.zoom.us/meeting/register/WFd4zBJcRFeTPl7-9_wJAw"
            },
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11713074"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11828575",
        "Description": "In celebration of International Education Week and the free film screening of Ramen Shop, you may enjoy f\nree ramen samples and ramen-inspired swag (while supplies last). Please RSVP in advance.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11828575"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11857666",
        "Description": "Join the GenerationOne Living-Learning Community as we celebrate National First-Generation College Celebration Week with a fun-filled Game Night! Enjoy an evening of board games, VR experiences, card games, arts and crafts, delicious food, and great company. This event is open to everyone, and we especially encourage on-campus first-generation students to join in the celebration. Come connect, unwind, and share in the good vibes with GenerationOne students as we honor NFGCCW together—\ndon’t forget to RSVP!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11857666"
            },
            {
                "label": "Talk-O Tuesday – Career Skill Building (How to Align Your Academic and Career Goals, Resume Check-up, Getting LinkedIn)Tuesday, November 11 at 5:30PM ESTNewman LibraryHosted by 2 organizations",
                "url": "https://gobblerconnect.vt.edu/event/11776767"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11819810",
        "Description": "Join us for a free screening of Ramen Shop at the Lyric Theater!  The first 100 people will receive complimentary popcorn!\nMovie synopsis:  When a young ramen chef from Japan finds his late Singaporean mother's journal, he takes it with him to her native country, hoping to put together the story of his family and his life.\nOpen to the public",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11819810"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11777262",
        "Description": "Join First-Generation Student Success and the Graduate Life Center for the First-Generation Graduate Luncheon—a welcoming space for graduate students to connect, learn, and plan for life during and after graduate school. This event offers a unique opportunity for first-generation graduate students to network with peers, faculty, and campus partners while exploring tools and resources that support academic and personal success. All graduate students are welcome to attend and learn more about the support available at Virginia Tech.\nEnjoy free lunch, great conversation, and exclusive swag as you build connections and strengthen your graduate experience!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11777262"
            },
            {
                "label": "Talk-O Tuesday – Career Skill Building (How to Align Your Academic and Career Goals, Resume Check-up, Getting LinkedIn)Tuesday, November 11 at 5:30PM ESTNewman LibraryHosted by 2 organizations",
                "url": "https://gobblerconnect.vt.edu/event/11776767"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11704918",
        "Description": "We’re excited to host an international level power electronics expert and educator speaker at Virginia Tech for an IEEE PELS Student Branch Chapter and the broad audience. With a wealth of experience in advancing technologies like renewable energy, electric vehicles, and smart grid systems, our speaker will delve into the latest trends and breakthroughs in power electronics. This talk offers students a unique chance to gain insights into the future of the field and explore how power electronics is transforming modern technology and industry. Don’t miss this opportunity to learn from a leader in power electronics innovation!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11704918"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11841192",
        "Description": "Join us Friday, November 14th for Soulful Friday! As the semester picks up, take a well deserved break to relax, recharge, and connect. Expect delicious food, great music, and fun games, everything you need for a good time.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11841192"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11784774",
        "Description": "Join us in celebrating the end of\nNative American Heritage Month\nthrough the\nNAHM Harvest Festival: Honoring People of Dark Water in Appalachia\n, a community gathering that honors Lumbee traditions and explores the role of food in sustaining cultural identity, health, and community resilience.\nChef René Locklear White\nfrom the Lumbee Tribe of North Carolina will lead a featured presentation expressing cultural and traditional Lumbee foods and traditional foodways tied to the Southeastern Woodlands communities.\nThe event will also include a\ncultural food tasting\n,\nhands-on workshops\nsuch as a\nnixtamalization workshop\n, a\ntea tasting workshop\n, and a\nTraditional Eastern Woodland ceramic table\nhighlighting Indigenous craftsmanship and food traditions. In addition, there will be presentations and displays from\nvarious Virginia Tech departments, programs, and Indigenous community student organizations\n, showcasing ongoing efforts to support Indigenous scholarship, sustainability, and community collaboration.\nHosted and coordinated by the\nIndigenous Community Garden at Virginia Tech (ICG)\nand Ati: Wa:Oki Indigenous Community  Center (ICC) and the program is supported by\nIndigenous Studies Program, Food Studies Program,\nDepartment of Fish and Wildlife Conservation,\nCenter for Food Sustainability and Community Transformation, Native@VT, AISES, SACNAS, Solitude-Fraction House, Native and Indigenous Alumni Society,\nBiocultural and Ecological Restoration Initiative (BERI\n), Virginia Free Farm, the Eastern Woodland Food Work Alliance (TEWFA),\nThe USDA National Institute of Food and Agriculture and NEXTGEN Program From Learning to Leading: Cultivating the Next Generation of Food and Agriculture Professionals; NEXTGENERATION INCLUSION CONSORTIUM (NIC) FOR BUILDING THE FOOD, AGRICULTURE, NATURAL RESOURCES, AND HUMAN SCIENCES PIPELINE (FANHP).\nThis event is\nfree and open-to-the-public\n. Attendees are encouraged to register to this event:\nhttps://forms.gle/b6Bj6cY4xvEkvLTv5",
        "info_urls": [
            {
                "label": "https://forms.gle/b6Bj6cY4xvEkvLTv5",
                "url": "https://forms.gle/b6Bj6cY4xvEkvLTv5"
            },
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11784774"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11796557",
        "Description": "The African Graduate Students’ Organization (AGSO) at Virginia Tech is hosting an event titled\nEXPERIENCE AFRICA\n, November 15, 2025\n, at 4\n:00 EST\nin\nSquires Student Center, Meeting Room 305\n. Join for an evening of\nnetworking\n,\nfun,\nand\nf\nood\nand learn how to get involved with AGSO, make friends, and navigate academic life successfully.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11796557"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11793814",
        "Description": "As part of our mission to build community among all graduate students interested in Engineering and related fields, this event will feature provided food, networking, and plenty of opportunities to connect and unwind before finals.\nCome enjoy good company, share your experiences, and make new connections. We’d love to see you there!\nPlease register here by November 14:\nGEA Mixer RSVP – Fill out form",
        "info_urls": [
            {
                "label": "GEA Mixer RSVP – Fill out form",
                "url": "https://forms.office.com/r/q1vTFPWsqF"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11568377",
        "Description": "Come talk about life with us! This is Church on Main's life group for college students, where all are welcome and loved. We do our best to keep it real, look for grace, and follow God. We meet after the 11:00 service at Church on Main. Currently reading When Christians Get it Wrong by Adam Hamilton.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11568377"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11792926",
        "Description": "Are you a fall fanatic? Come to the Great Room and compete with a team in Fall Trivia Night! Cozy up with some hot apple cider and donuts for some late-night friendly fun.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11792926"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11857014",
        "Description": "It’s that time of year to give thanks—and share snacks! Join us for\nStudio 72’s SNACKSGIVING\n, a cozy community get-together where everyone brings a favorite snack to share. Whether it’s sweet, salty, homemade, or store-bought, all snacks are welcome!\nCome hang out, snack around, and celebrate creativity, gratitude, and good vibes with your Studio 72 family. Bring something tasty, try something new, and enjoy an evening of laughter and connection.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11857014"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11443156",
        "Description": "DATE: Mondays starting September 15, 2025\nTIME: 4:00 – 6:00 PM EST\nLOCATION: APIDA + Center (140 Squires)\nLooking for a weekly boost to stay on track with your classes? Let's Lock In meets once a week – every Monday - to give you a dedicated time and space to focus, get support, and make real progress. Join other students in a relaxed, productive environment where tutors are on hand to help with coursework, and other campus resources are just a step away. Think of it like study hall, but better: whether you're tackling tough assignments, prepping for exams, or just trying to stay organized, Let's Lock In is here to help. Drop in, get focused, and leave feeling accomplished.\nCo-sponsored with the APIDA + Center/AANAPISI Initiative and the Student Success Center",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11443156"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11809952",
        "Description": "Academic bullying remains a persistent and complex issue within higher education, shaped by entrenched hierarchies, hyper-competitive environments, and a culture that often makes toxic behaviors feel untouchable. These dynamics can be especially isolating for graduate students, who frequently navigate unclear boundaries and power imbalances.\nOne way we hope to frame this discussion is by normalizing the conversation around academic bullying—recognizing that part of the problem is how inaccessible or uncomfortable the topic can feel. When we struggle to name these behaviors, we risk allowing them to continue unchecked.\nIn this event, we will explore the structural and cultural forces that allow academic bullying to persist and consider how graduate students, faculty, and institutions can work together to challenge them. While barriers to change are real, we believe in the power of collective effort to promote healthier, more equitable academic spaces.\nJoin us to name the problem—and imagine the solutions.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11809952"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11500171",
        "Description": "Just Journaling\nNovember's Theme: Junk Journaling\nTuesday, November 18 | 12:00 - 2:00 PM\nPride Center (Squires 227)\nThis is a monthly series that explores the mental health benefits of journaling.\nEach session will focus a different journaling method  to help participants identify which mediums work best to meet their needs. Journals will be provided along with a wide variety of crafting and art supplies, allowing each participant to personalize their experience.\nNovember's session will focus on junk journaling. We'll provide materials for collage, but you are welcome to bring your own as well!\nBox lunches will be provided.\nAll are welcome to join!\nFor accommodations contact Haleigh Wallace at haleighwallace@vt.edu.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11500171"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11568716",
        "Description": "Join us for an evening honoring the art, rhythm, and passion of\nFlamenco\nand to get to know more about each other!\nThe event will feature a\nspecial talk by our Flamenco teacher, Maria del Carmen Caña Jimenez\n, professor of Spanish here at Virginia Tech.\nWhether you are a dancer, a music lover, or simply curious about Spanish culture, everyone is welcome!\nOlé 💃!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11568716"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11745388",
        "Description": "Come relax, sip on bubble tea, and enjoy an afternoon of play! Join us for Bubble Tea and Games, a casual gathering where you can try out a variety of traditional and modern Chinese board and card games. Whether you’re a seasoned player or completely new, this is a fun way to learn, connect, and share in friendly competition.\nWe’ll provide the games and teach you the rules—just bring your curiosity (and your sweet tooth)!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11745388"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11832490",
        "Description": "Come celebrate at our Intercultural Open Mic Night! Join us for\nan evening of spoken word, music, stories, and more, celebrating the unique backgrounds of our community\n. Whether you want to perform or just enjoy the show, come share an experience of cultural exchange, community, and connection.\nWhat it is:\nAn open mic event focused on celebrating diverse cultures through various art forms like poetry, music, storytelling, and more.\nWhat to expect:\nA supportive and inclusive atmosphere where everyone can share their culture and identity.\nHow to participate:\nPerformers can sign up to share their talents, while the audience can come to listen, learn, and be inspired.\nWhy it's important:\nIt's an opportunity to build community, foster intercultural respect, and discover new perspectives through art and performance.\nPlease sign up using the\nlink\nto perform\nhttps://forms.office.com/r/hkV3xibPXd\nPlease enter the door into Harper Hall that faces West End/Cochrane Hall.",
        "info_urls": [
            {
                "label": "link",
                "url": "https://forms.office.com/r/hkV3xibPXd"
            },
            {
                "label": "https://forms.office.com/r/hkV3xibPXd",
                "url": "https://forms.office.com/r/hkV3xibPXd"
            },
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11832490"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11728863",
        "Description": "Last community hour of the semester! The winning suite chooses our Spring field trip.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11728863"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11854650",
        "Description": "Wesley is hosting a Silent Disco!! This is completely free and open to all!! Bring a friend and your best dance moves!!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11854650"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11806831",
        "Description": "Get some donuts for them for extra calories and freshly brewed coffee for the extended working hours (courtesy of your PI). Blow off some steam and look forward to some fun chit-chat and lively banter with all the graduate students in the Department of Mechanical Engineering. It is a great platform to discuss work or classes with your ME peers, if you may (we are looking at all you nerds and geeks). Network, socialize, and put on some weight while at it!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11806831"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11861366",
        "Description": "The Henry Dekker Leadership Seminar will include the speakers Major General Bruce Scott, Major General William Seely, Nancy Brittle, and Dr. Bruce. This event is completely free and will be catered. The dress is business casual.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11861366"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11626313",
        "Description": "Celebrate community, creativity, and gratitude at Art of Appreciation Night on Wednesday, November 19, 2025, in the Graduate Life Center Auditorium and Info Booth.\nThis special evening is all about recognizing the people, experiences, and moments that shape our graduate journey. Through interactive activities, creative expression, and meaningful conversations, you’ll have the chance to pause, reflect, and share appreciation in fun and inspiring ways.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11626313"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11846727",
        "Description": "We are often asked to say “yes” to requests that matter\na lot\nto our colleagues. Saying “no” to something important can feel risky—potentially straining relationships or triggering responses that we’d rather avoid. Being able to say “no” clearly, compassionately, and with good preparation for the potential response allows us to maintain the boundaries that make sustainable working relationships possible.\nIn this session, you’ll learn and practice:\nA practical framework for saying “no” in ways that protect key relationships and spark constructive dialogue\nHow to name and stay connected to what truly matters to you as you say “no”\nHow to respond compassionately and effectively when others are disappointed, upset, or confused by your “no.”\nAll are welcome to join. Please be sure to RSVP as refreshments will be served.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11846727"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11717391",
        "Description": "Roots to Wellness: Sit n Sew Workshops\nTake time for yourself while learning sustainable skills to care for your clothing and your well-being. Sit n Sew is a welcoming, creative space where community, self-care, and sustainability meet. All workshops are open to everyone, no prior sewing experience required. Supplies provided—just bring your creativity (and a piece of clothing if you’d like).\nWorkshops:\nMending Workshop\n🗓\nThursday, October 9, 2025 | 5:30–7:30 PM | Squires 122\nCome learn how to mend and alter your own clothing! Bring a beloved item to patch, hem, stitch back up, or add buttons to. Mending is an environmentally conscious practice and a soothing form of self-care. Take time to relax, learn new skills, and care for yourself in community.\nUpcycling Workshop\n🗓\nThursday, November 20, 2025 | 5:30–7:30 PM | Squires 122\nGive your wardrobe a refresh! Learn how to elevate and transform items you already own through simple alterations, embellishments, and creative changes. Upcycling is a sustainable way to fall in love with your clothes again while practicing mindfulness and care.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11717391"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11692535",
        "Description": "Friendsgiving social dinner held around the Thanksgiving season to bring together students for a night of food, friendship, and cultural exchange. This gathering provides an opportunity for international students, especially Vietnamese students who may not celebrate the holiday with family in the US, to enjoy a warm and inclusive environment. All Vietnamese fellows are welcome to bring their international friends to try our Vietnamese dishes, connect with peers from diverse backgrounds, play traditional Vietnamese board games, and experience our karaoke culture.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11692535"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11617837",
        "Description": "During these lunches, Latinx graduate students and friends have the opportunity to connect and engage with one another by sharing and celebrating their cultures. These gatherings not only foster social connections but also provide a chance to exchange stories, traditions, and experiences, enriching the community as a whole. Everyone is welcome!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11617837"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11806833",
        "Description": "Get some donuts for them for extra calories and freshly brewed coffee for the extended working hours (courtesy of your PI). Blow off some steam and look forward to some fun chit-chat and lively banter with all the graduate students in the Department of Mechanical Engineering. It is a great platform to discuss work or classes with your ME peers, if you may (we are looking at all you nerds and geeks). Network, socialize, and put on some weight while at it!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11806833"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11825942",
        "Description": "Join us to discuss the end of fall semester, review our past events, and discuss what the spring semester will hold, all over delicious Roots catering!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11825942"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11443157",
        "Description": "DATE: Mondays starting September 15, 2025\nTIME: 4:00 – 6:00 PM EST\nLOCATION: APIDA + Center (140 Squires)\nLooking for a weekly boost to stay on track with your classes? Let's Lock In meets once a week – every Monday - to give you a dedicated time and space to focus, get support, and make real progress. Join other students in a relaxed, productive environment where tutors are on hand to help with coursework, and other campus resources are just a step away. Think of it like study hall, but better: whether you're tackling tough assignments, prepping for exams, or just trying to stay organized, Let's Lock In is here to help. Drop in, get focused, and leave feeling accomplished.\nCo-sponsored with the APIDA + Center/AANAPISI Initiative and the Student Success Center",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11443157"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11414857",
        "Description": "Join us for Presentation Night—an invaluable opportunity to refine your group project before the big day! This supportive and low-pressure environment gives each group the chance to present in front of peers and receive constructive feedback from the professor. You'll get tips on timing, delivery, and content to help strengthen your final presentation. Whether you're looking to boost your confidence, improve clarity, or fine-tune your slides, this is your chance to shine and level up your project. Don’t miss out on this valuable prep session!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11414857"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11833949",
        "Description": "Join us in the math department Commons Room (MCB 455) for holiday snacks and study buddies on Tuesday, December 2. We know finals week is approaching fast, so we wanted to create a space for you to take a break from studying, enjoy some snacks and visit with friends who are also cramming for finals.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11833949"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11411550",
        "Description": "Every Tuesday this fall, the first five students to meet at Turner Place Dining Hall at 5:15 PM will get their meal covered! Join the Program Director and your fellow Securitas community members for a weekly dinner hangout before your evening class. It’s a great way to relax, connect, and enjoy good food together. Turner Tuesday runs from August 26 to December 2, 5:15–6:15 PM. First come, first served!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11411550"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11379105",
        "Description": "Interested in a summer internship or undergraduate research experience? Meet with the College of Science and the Office of Undergraduate Research to learn more about paid research and research for credit over the summer!\nIf you are an individual with a disability and desire an accommodation, please contact Jess Hoopengardner at jessh@vt.edu at least 10 business days prior to the event.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11379105"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11845213",
        "Description": "Come drink vegan hot cocoa and watch a movie before finals start!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11845213"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11511268",
        "Description": "",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11511268"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11660578",
        "Description": "More details to come",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11660578"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11859588",
        "Description": "Celebrate the end of the semester and the winter holidays with an afternoon of fun and relaxation. Connect with fellow grad students over snacks and a craft! Join us for part or all of the afternoon to destress from finals, socialize, and get your creativity flowing.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11859588"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11404770",
        "Description": "Join us for a reception celebrating the opening of\nYoung Artists: dreamscapes\n,\nfeaturing student artists from Craig County High School.",
        "info_urls": [
            {
                "label": "Performance: Hotel Modern \"The Great War\"Thursday, November 6 at 7:30PM ESTCenter for the ArtsThe Center for the Arts at Virginia Tech",
                "url": "https://gobblerconnect.vt.edu/event/11504846"
            },
            {
                "label": "Post-Performance Peek: A Close-Up of \"The Great War's\" Miniature WorldThursday, November 6 at 8:30PM ESTCenter for the ArtsThe Center for the Arts at Virginia Tech",
                "url": "https://gobblerconnect.vt.edu/event/11504890"
            },
            {
                "label": "Performance: Hotel Modern \"The Great War\"Friday, November 7 at 7:30PM ESTCenter for the ArtsThe Center for the Arts at Virginia Tech",
                "url": "https://gobblerconnect.vt.edu/event/11504847"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11711963",
        "Description": "A relaxing study break where students can recharge with Vietnamese instant coffee and light snacks during finals week. The event provides a cozy environment to refresh, connect, and share study tips.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11711963"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11617862",
        "Description": "During these lunches, Latinx graduate students and friends have the opportunity to connect and engage with one another by sharing and celebrating their cultures. These gatherings not only foster social connections but also provide a chance to exchange stories, traditions, and experiences, enriching the community as a whole. Everyone is welcome!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11617862"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11846946",
        "Description": "Decompress with BMES! Join us in taking a step back to refresh and reflect on the Fall 2025 semester. We will be serving lunch and hot chocolate, as well as coloring pages to help de-stress and casually converse with peers.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11846946"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11859643",
        "Description": "Take a break from finals and join your fellow AOE graduate students for our end of the semester social! Enjoy an evening of bowling, pool, and food at Breakzone!\nWhether you are a pro at bowling or have never picked up a ball in your life, feel free to join us for an evening of relaxation and community!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11859643"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11831335",
        "Description": "We will have carolee donuts and have a christmas movie playing while enjoying everyones company. An opportunity to socialize have breakfast and also start you day off right.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11831335"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11489293",
        "Description": "Learn how to waltz at our Disney-themed social dance! We'll have a one-hour lesson perfect for beginners, followed by two hours of social dancing around the GLC's Multipurpose Room. This is a great opportunity to meet new people and learn to dance, the last of which for this semester. You don't want to miss out!! No partner or experience necessary.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11489293"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11855020",
        "Description": "This social event is intended to promote networking, and a sense of community, and provide an avenue for students to share goodies.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11855020"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11568378",
        "Description": "Come talk about life with us! This is Church on Main's life group for college students, where all are welcome and loved. We do our best to keep it real, look for grace, and follow God. We meet after the 11:00 service at Church on Main. Currently reading When Christians Get it Wrong by Adam Hamilton.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11568378"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11443158",
        "Description": "DATE: Mondays starting September 15, 2025\nTIME: 4:00 – 6:00 PM EST\nLOCATION: APIDA + Center (140 Squires)\nLooking for a weekly boost to stay on track with your classes? Let's Lock In meets once a week – every Monday - to give you a dedicated time and space to focus, get support, and make real progress. Join other students in a relaxed, productive environment where tutors are on hand to help with coursework, and other campus resources are just a step away. Think of it like study hall, but better: whether you're tackling tough assignments, prepping for exams, or just trying to stay organized, Let's Lock In is here to help. Drop in, get focused, and leave feeling accomplished.\nCo-sponsored with the APIDA + Center/AANAPISI Initiative and the Student Success Center",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11443158"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11710446",
        "Description": "Happy Last Day of Class, Hokies! Stop by the Information Booth B in Squires Student Center for a free donut! We'll be at Info Booth B until 10:30, or until supplies runs out!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11710446"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11771520",
        "Description": "The Forest Resources and Environmental Conservation's Graduate Student Association (FGSA) is hosting the last inter-departmental Pizza Social of the semester open to all graduate students in the College of Natural Resources and Environment (CNRE)—including Forest Resources and Environmental Conservation, Fish and Wildlife Conservation, Geography, and Sustainable Biomaterials.\nBy sharing a meal, we aim to break down barriers to participation while fostering collaboration, interdisciplinary dialogue, and resource sharing among CNRE graduate students. These recurring gatherings will provide a consistent, inclusive space that promotes well-being, builds both professional and personal connections, and strengthens our graduate student community.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11771520"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11647487",
        "Description": "Come build your very own stuffed critter! You’ll get to stuff it yourself, dress it up, and even design a custom shirt to make it one-of-a-kind. A fun, creative way to make a new fuzzy friend!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11647487"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11511310",
        "Description": "Need a chance to lock in before final exams? Come out to the NSBE Undergraduate Council Study-A-Thon! We will have food, games, and spaces to study!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11511310"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11814679",
        "Description": "On reading day, December 11, students will be invited to spend time together in queer community. Whether individuals are looking for time to work and study, or to socialize, we are providing a space to prepare for the end of the semester together. We will provide food, drinks, and de-stress items such as fidget toys for individuals who attend.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11814679"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11710459",
        "Description": "Stop by Squires Room 226 on the 2nd floor of Squires to put together your Finals Survival Kit! We will be there from 2-4, or until supplies runs out!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11710459"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11848664",
        "Description": "The INFORMS Student Chapter at Virginia Tech will host\nDr. Shu-Kai Fan\nfrom the National Taipei University of Technology for a seminar titled\n“Optimizing floating crane operations for efficient bulk product transshipments on inland waterways.”\nThe event will be held virtually via Microsoft Teams; in-person viewing in Durham 260.\nThe event is open to all students and anyone interested in the fields of Operations Research, Manufacturing Systems and Processes, and Management Sciences\n. It's a great opportunity to engage with cutting-edge research and interact with a leading scholar in the field!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11848664"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11847350",
        "Description": "We are hosting a dinner mixer for IGC fellows, so fellows joining in January 2026 can get to know current their new cohort and current fellows who have been with the IGC for longer. We will provide dinner and snacks, as well as arts and crafts, so students can bond over a shared activity and food.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11847350"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11771063",
        "Description": "Step right up for Gobblernights: The Boardwalk! We're bringing all the summer vibes to the middle of winter! Join us on Friday, January 23rd from 8–10:30 PM in Squires Student Center for a night of boardwalk fun, games, and prizes. Enjoy classic summer activities, play to earn tickets, and trade them in for the chance to win exciting prizes. It’s the perfect way to beat the winter chill and make your own sunshine with friends. Don’t miss out on this warm-weather escape right here on campus!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11771063"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11859688",
        "Description": "CSGC officers meet every other week in this meeting to review updates from the CS department and plan how to effectively communicate these updates to the general CS graduate student body. We also make necessary arrangements for any upcoming events being organized by CSGC. While this is an internal CSGC meeting, the general CS graduate student population is welcome to attend the meeting as well.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11859688"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11333963",
        "Description": "🎉\nExperience the Vibrant Spirit of Türkiye!\nJoin the\nTurkish Student Association at Virginia Tech\n,\nDining Services\n, and the\nCranwell International Center\nfor an unforgettable celebration of Turkish culture!\n📍\nDeet’s Place (Large Side Room)\n📅\nFriday, January 30th, 4:00 PM to 6:00 PM\n🎟\nFree Admission + Exciting Giveaways!\n✨\nWhat to Expect:\nEnjoy\nsavory and sweet Turkish dishes\nand an\nauthentic beverage\n, all provided by Dining Services\nExplore\ncolorful cultural displays\ncreated by VT's own Turkish Student Association\nWatch\nstudent-led presentations\nthat bring Türkiye’s rich history and traditions to life\nTest your knowledge in\nfun trivia games\nWin prizes — including a chance to score\n2 FREE tickets to a Center for the Arts performance!\nThis is your chance to\nimmerse yourself in Turkish culture\n, connect with new people, and celebrate the beauty of international community right here at Virginia Tech!\n📧\nAccessibility Accommodations:\nIf you are an individual with a disability and require accommodations, please contact\nFawna Zwart\nat\nfawna@vt.edu\nduring regular business hours at least\n10 business days before the event\n.\nCome curious, leave inspired —\nHoş geldiniz! (Welcome!)",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11333963"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11848665",
        "Description": "The INFORMS Student Chapter at Virginia Tech will host\nDr. Reza Tavakkoli-Moghaddam\nfrom the University of Tehran for a seminar titled\n“Scheduling multi-configuration last-mile delivery logistics by learning from optimization feedback and customer preferences.”\nThe event will be held virtually via Microsoft Teams; in-person viewing in Durham 260.\nThe event is open to all students and anyone interested in the fields of Operations Research, Manufacturing Systems and Processes, and Management Sciences\n. It's a great opportunity to engage with cutting-edge research and interact with a leading scholar in the field!",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11848665"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11774458",
        "Description": "In honor of the 100th anniversary of Black History Month, the BCO presents\nBlack Excellence in Uniform: Celebrating Service and Legacy\n—a powerful  panel dedicated to educating, inspiring, and honoring the service of African American military members, both past and present. This event aims to foster meaningful dialogue between Virginia Tech cadets, students, and distinguished panelists who serve or have served in active duty or reserve roles. By showcasing the resilience, leadership, and contributions of Black service members, we seek to highlight their enduring legacy and motivate the next generation to lead with purpose, pride, and excellence.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11774458"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11859689",
        "Description": "Description: CSGC officers meet every other week in this meeting to review updates from the CS department and plan how to effectively communicate these updates to the general CS graduate student body. We also make necessary arrangements for any upcoming events being organized by CSGC. While this is an internal CSGC meeting, the general CS graduate student population is welcome to attend the meeting as well.",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11859689"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11334058",
        "Description": "🎉\nExperience the Vibrant Spirit of China!\n🇨🇳\nJoin the\nAssociation of Chinese Students and Scholars at Virginia Tech\n,\nDining Services\n, and the\nCranwell International Center\nfor an unforgettable celebration of Chinese culture!\n📍\nDeet’s Place (Large Side Room)\n📅\nFriday, February 20th, 4:00 PM to 6:00 PM\n🎟\nFree Admission + Exciting Giveaways!\n✨\nWhat to Expect:\nEnjoy\nsavory and sweet Chinese dishes\nand an\nauthentic beverage\n, all provided by Dining Services\nExplore\ncolorful cultural displays\ncreated by VT's own Association of Chinese Students and Scholars\nWatch\nstudent-led presentations\nthat bring China’s rich history and traditions to life\nTest your knowledge in\nfun trivia games\nWin prizes — including a chance to score\n2 FREE tickets to a Center for the Arts performance!\nThis is your chance to\nimmerse yourself in Chinese culture\n, connect with new people, and celebrate the beauty of cultural community right here at Virginia Tech!\nEveryone is Welcome!\n📧\nAccessibility Accommodations:\nIf you are an individual with a disability and require accommodations, please contact\nFawna Zwart\nat\nfawna@vt.edu\nduring regular business hours at least\n10 business days before the event\n.\nCome curious, leave inspired —\n欢迎光临! (Welcome!)",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11334058"
            }
        ]
    },
    {
        "url": "https://gobblerconnect.vt.edu/event/11333964",
        "Description": "🎉\nExperience the Vibrant Spirit of Africa!\nJoin the\nAfrican Students Association at Virginia Tech\n,\nDining Services\n, and the\nCranwell International Center\nfor an unforgettable celebration of Turkish culture!\n📍\nDeet’s Place (Large Side Room)\n📅\nFriday, March 27th, 4:00 PM to 6:00 PM\n🎟\nFree Admission, All are Welcome! + Exciting Giveaways!\n✨\nWhat to Expect:\n🍽️ Enjoy savory and sweet African dishes and authentic beverages, all provided by Dining Services\n🎨 Explore colorful cultural displays created by VT's own African Student Association\n🎤 Watch student-led presentations that bring Africa’s rich culture and traditions to life\n🧠 Test your knowledge in fun trivia games\n🏆 Win prizes — including a chance to score\n2 FREE tickets\nto the Center for the Arts performance!\nThis is your chance to immerse yourself in\nAfrican culture\n, connect with new people, and celebrate the beauty of international community right here at Virginia Tech!\n📧\nAccessibility Accommodations:\nIf you are an individual with a disability and require accommodations, please contact\nFawna Zwart\nat\nfawna@vt.edu\nduring regular business hours at least\n10 business days before the event\n.\nCome curious, leave inspired — https://gobblerconnect.vt.edu/organization/asavt",
        "info_urls": [
            {
                "label": "Sign in to RSVP",
                "url": "https://gobblerconnect.vt.edu/account/login?returnUrl=/event/11333964"
            }
        ]
    }
]